// 자바처럼 데이터 형이 없고 var, const, let키워드로 씀(들어오는 값을 보고 데이터 타입을 유추해서 판단함)
// 주로 변수처럼 사용할 때는 let을 씀, 고정할 값은 const
// prompt로 받는건 무조건 스트링타입으로만 받음 
// 만약 숫자타입으로 쓰고싶으면 Number를 이용해서 숫자로 형변환 해줘야함!
let a = prompt("첫번째 수 입력하시오");
let b = prompt("두번째 수 입력 : ", "");
let c = prompt("세번째 수 입력 : ", "");

document.write("<h3>max : " + Math.max(a,b,c) + "</h3>");
document.write("<h3>min : " + Math.min(a,b,c) + "</h3>");
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// console.log(typeof(변수명)) : 데이터 타입 보기
// console.log는 디버깅하려고 씀
let test1 = 1.333;
console.log(typeof(test1)); // number 타입
let test2 = false;
console.log(typeof(test2)); // boolean 타입
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
let test3 = 100;
let test4 = 200;
console.log("합 : " + (test3 + test4)); // 출력 :  300

let test5 = "100";
let test6 = 200;
console.log(`합 : ${test5 + test6}`); // 출력 :  100200(문자열로 그대로 붙어버림)

let dan = 3;
let gugu = 8;
let result = Math.round(dan * gugu);
console.log(result); // 출력 : 24
console.log(`${dan} 곱하기 ${gugu}은 ${dan * gugu}입니다.`); // 출력 :  3 곱하기 8은 24입니다.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
let isAdult = false;
let age = prompt("나이를 입력하세요 : ", "");
age = Number(age); // Number : 문자타입을 숫자타입으로 바꿔주는 형변환
isAdult = (age > 18) ? true : false;
if (isAdult) document.write("<h3>당신은 성인입니다.</h3>");
else document.write("<h3>당신은 성인이 아닙니다.</h3>");
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// document.write : 웹화면에만 출력됨
// console.log : 사용자화면에 출력안됨(F12) 개발자 화면에서만 봐야함
// 둘 중 어떤 것을 골라야하는가 : 누구에게 알려줄 것이냐에 초점두기! 사용자? 개발자(디버깅용)?
// `${}`이건 뭘까..?
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
